In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [2]:
series = Series(np.arange(3), index=['a', 'b', 'c'])
series

a    0
b    1
c    2
dtype: int32

In [3]:
series.drop('a') # Drop row. Does not modify original.

b    1
c    2
dtype: int32

In [4]:
series

a    0
b    1
c    2
dtype: int32

In [5]:
df = DataFrame(np.arange(9).reshape((3, 3)), index=['A', 'B', 'C'], columns=['Z', 'X', 'Y'])
df

   Z  X  Y
A  0  1  2
B  3  4  5
C  6  7  8

In [6]:
df.drop('A') # Drop row. Does not modify original.

   Z  X  Y
B  3  4  5
C  6  7  8

In [7]:
df

   Z  X  Y
A  0  1  2
B  3  4  5
C  6  7  8

In [8]:
df.drop('X', axis=1) # Drop column. Does not modify original.

   Z  Y
A  0  2
B  3  5
C  6  8

In [9]:
df

   Z  X  Y
A  0  1  2
B  3  4  5
C  6  7  8